<?php


use App\Maze;
use PHPUnit\Framework\TestCase;

class MazeTest extends TestCase
{
    public function dataProvider()
    {
        return [
            // Лабиринт без старта и финиша
            ['data' => [
                [0, 0, 0, 0],
                [0, 0, 0, 0],
                [0, 0, 0, 0],
                [0, 0, 0, 0]
            ],
                'expectMess' => 'Не заданы точки начала или финиша'
            ],
            // Лабиринт с одним стартом без финиша
            ['data' => [
                [0, 0, 0, 0],
                [0, -1, 0, 0],
                [0, 0, 0, 0],
                [0, 0, 0, 0]
            ],
                'expectMess' => 'Не заданы точки начала или финиша'
            ],
            // Лабиринт с одним финишем без старта
            ['data' => [
                [0, 0, 0, 0],
                [0, 0, 0, 0],
                [0, 0, 10, 0],
                [0, 0, 0, 0]
            ],
                'expectMess' => 'Не заданы точки начала или финиша'
            ],
            // Лабиринт с двумя стартами без финиша
            ['data' => [
                [0, 0, 0, 0],
                [0, -1, -1, 0],
                [0, 0, 0, 0],
                [0, 0, 0, 0]
            ],
                'expectMess' => 'Больше одной точки старта или финиша'
            ],
            // Лабиринт с двумя финишами без старта
            ['data' => [
                [0, 0, 0, 0],
                [0, 0, 10, 0],
                [0, 0, 10, 0],
                [0, 0, 0, 0]
            ],
                'expectMess' => 'Больше одной точки старта или финиша'
            ],
            // Лабиринт с двумя финишами и одним стартом
            ['data' => [
                [0, 0, 0, 0],
                [0, -1, 10, 0],
                [0, 0, 10, 0],
                [0, 0, 0, 0]
            ],
                'expectMess' => 'Больше одной точки старта или финиша'
            ],
            // Лабиринт с двумя стартами и одним финишем
            ['data' => [
                [0, 0, 0, 0],
                [0, -1, -1, 0],
                [0, 0, 10, 0],
                [0, 0, 0, 0]
            ],
                'expectMess' => 'Больше одной точки старта или финиша'
            ],
            // Лабиринт с двумя стартами и двумя финишами
            ['data' => [
                [0, 0, 0, 0],
                [0, -1, -1, 0],
                [0, 10, 10, 0],
                [0, 0, 0, 0]
            ],
                'expectMess' => 'Больше одной точки старта или финиша'
            ],


        ];
    }

    /**
     * @dataProvider dataProvider
     */
    public function test__construct(array $data, string $expected)
    {
        $this->expectExceptionMessage($expected);
        new Maze($data);
    }

    public function testFindPathCost()
    {

    }
}
